# Chapter 2.판다스

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
    "메뉴" :['아메리카노', '카페라떼', '카페모카', '카푸치노','에스프레소','밀크티','녹차'],
    "가격" : [4500, 5000,5500, 5000, 4000,5900,5300],
    "칼로리" : [10,110,250, 110, 20, 210, 0],
})
df

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110
2   카페모카  5500  250
3   카푸치노  5000  110
4  에스프레소  4000   20
5    밀크티  5900  210
6     녹차  5300    0

## 3. 탐색적 데이터 분석(EDA)

In [3]:
df.sample(3)

     메뉴    가격  칼로리
5   밀크티  5900  210
2  카페모카  5500  250
6    녹차  5300    0

In [4]:
df.shape

(7, 3)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      7 non-null      object
 1   가격      7 non-null      int64
 2   칼로리     7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 296.0+ bytes

In [6]:
df.corr(numeric_only=True)

           가격       칼로리
가격   1.000000  0.713227
칼로리  0.713227  1.000000

In [9]:
df_car = pd.DataFrame({
    "car" :['Sedan','SUV','Sedan','SUV','SUV','SUV','Sedan','Sedan','Sedan','Sedan','Sedan'],
    "size" : ['S','M','S','S','M','M','L','S','S','M','S']
})
df_car.head(3)

     car size
0  Sedan    S
1    SUV    M
2  Sedan    S

In [10]:
print(df_car['car'].value_counts())
print(df_car['size'].value_counts())

car
Sedan    7
SUV      4
Name: count, dtype: int64
size
S    6
M    4
L    1
Name: count, dtype: int64

In [12]:
df.describe()

                가격         칼로리
count     7.000000    7.000000
mean   5028.571429  101.428571
std     631.702160   99.402980
min    4000.000000    0.000000
25%    4750.000000   15.000000
50%    5000.000000  110.000000
75%    5400.000000  160.000000
max    5900.000000  250.000000

In [14]:
df_car.describe(include="O")

          car size
count      11   11
unique      2    3
top     Sedan    S
freq        7    6

In [18]:
data = {
    "메뉴" :['아메리카노', '카페라떼', '카페모카', '카푸치노','에스프레소','밀크티','녹차'],
    "가격" : [4500.0, 5000.0, 5500.0 , 5000.0, 4000.0,5900.0,5300.0],
    "칼로리" : ['10','110','250', '110', '20', '210', '0'],
}
df = pd.DataFrame(data)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      7 non-null      object
 1   가격      7 non-null      float64
 2   칼로리     7 non-null      object
dtypes: float64(1), object(2)
memory usage: 296.0+ bytes

In [19]:
df['가격'] = df['가격'].astype('int')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      7 non-null      object
 1   가격      7 non-null      int32
 2   칼로리     7 non-null      object
dtypes: int32(1), object(2)
memory usage: 268.0+ bytes

In [20]:
df['칼로리'] = df['칼로리'].astype('float')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      7 non-null      object
 1   가격      7 non-null      int32
 2   칼로리     7 non-null      float64
dtypes: float64(1), int32(1), object(1)
memory usage: 268.0+ bytes

In [24]:
df = pd.read_csv('cafe.csv')
discount = 0.2
df['할인가'] = df['가격'] * (1-discount)
df.head(2)

      메뉴    가격  칼로리     할인가
0  아메리카노  4500   10  3600.0
1   카페라떼  5000  110  4000.0

In [25]:
print(df.head(3))
df.drop(1,axis=0,inplace= True)
df.head(3)

      메뉴    가격  칼로리     할인가
0  아메리카노  4500   10  3600.0
1   카페라떼  5000  110  4000.0
2   카페모카  5500  250  4400.0

      메뉴    가격  칼로리     할인가
0  아메리카노  4500   10  3600.0
2   카페모카  5500  250  4400.0
3   카푸치노  5000  110  4000.0

In [26]:
df = df.drop('칼로리', axis = 1)
df.head(3)

      메뉴    가격     할인가
0  아메리카노  4500  3600.0
2   카페모카  5500  4400.0
3   카푸치노  5000  4000.0

In [27]:
df = pd.read_csv('cafe.csv')
df.head(2)

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110

In [30]:
print(df.loc[0])
df.loc[1, "가격"]

메뉴     아메리카노
가격      4500
칼로리       10
Name: 0, dtype: object

5000

In [33]:
print(df.loc[2,"메뉴":"칼로리"])
df.loc[2,["메뉴", "칼로리"]]

메뉴     카페모카
가격     5500
칼로리     250
Name: 2, dtype: object

메뉴     카페모카
칼로리     250
Name: 2, dtype: object